jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32U575/FS_NOR_HW_SPIFI_STM32U575_ST_STM32U575I_EV.c
  FS_USE_PARA(Unit);
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  //
  // Fill local variables.
  //
  InstReg  = 0;
  InstMode = _CalcTransferMode(BusWidth, NumBytesCmd);
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Calculate the number of bytes in the instruction.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  //
  // Configure the operation.
  //
  CfgReg  = 0
          | (InstMode << CCR_IMODE_BIT)
          | (InstDTR  << CCR_IDTR_BIT)
          | (InstSize << CCR_ISIZE_BIT)
          ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK  << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_WRITE << CR_FMODE_BIT;
  TCfgReg    =   OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                                                // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  //
  // Execute the command.
  //
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                                              // Error, could not clear status flags.
  }
  OCTOSPI_DCR1 = DevCfgReg;
  OCTOSPI_CR   = CtrlReg;
  OCTOSPI_DLR  = 0;
  OCTOSPI_ABR  = 0;
  OCTOSPI_CCR  = CfgReg;
  OCTOSPI_TCR  = TCfgReg;
  OCTOSPI_IR   = InstReg;
  //
  // Wait until the command has been completed.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                                                // Error, OCTOSPI is not ready.
      break;
    }
  }
Done:
  return r;
}

/*********************************************************************
*
*       _Read
*
*  Function description
*    Transfers data from NOR flash to MCU.
*/
static int _Read(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U8 * pData, unsigned NumBytesData, U16 BusWidth, unsigned Flags) {
  U32 AddrReg;
  U32 AltReg;
  U32 CfgReg;
  U32 CtrlReg;
  U32 DataMode;
  U32 AddrMode;
  U32 AltMode;
  U32 InstMode;
  U32 AltSize;
  U32 AddrSize;
  U32 NumBytes;
  U32 NumBytesAlt;
  U32 NumBytesToRead;
  U32 InstReg;
  U32 InstSize;
  U32 InstDTR;
  U32 AddrDTR;
  U32 DataDTR;
  U32 NumCyclesDummy;
  U32 TCfgReg;
  int r;
  int Result;
  U32 MemType;
  U32 DevCfgReg;
  U32 TimeOut;

  FS_USE_PARA(Unit);
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  AddrDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_ADDR) != 0u) {
    AddrDTR = 1;
  }
  DataDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_DATA) != 0u) {
    DataDTR = 1;
  }
  //
  // Fill local variables.
  //
  InstReg     = 0;
  AddrReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the dummy and mode bytes.
  //
  NumCyclesDummy = 0;
  if (NumBytesAlt != 0) {
    NumBytes = NumBytesAlt;
    //
    // Check if a mode byte has to be sent and if yes encode its value.
    //
    if (   ((Flags & FS_NOR_HW_FLAG_MODE_8BIT) != 0u)
        || ((Flags & FS_NOR_HW_FLAG_MODE_4BIT) != 0u)) {                            // OCTOSPI is not able to send a number of mode bits that is not a multiple of eight.
      NumBytes    = NumBytesAlt - 1u;
      NumBytesAlt = 1;                                                              // We never send more than one mode byte.
      if (pPara != NULL) {
        AltReg = (U32)*pPara;
      } else {
        AltReg = 0xFFuL;
      }
    } else {
      NumBytesAlt = 0;
    }
    if (NumBytes != 0u) {
      //
      // The remaining alternate bytes are not sent. Instead, we generate dummy cycles.
      //
      NumCyclesDummy = _CalcNumCycles(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytes, AddrDTR);
    }
  }
  //
  // Calculate the number of data lines to be used for the transfer.
  //
  InstMode = _CalcTransferMode(FS_BUSWIDTH_GET_CMD(BusWidth), NumBytesCmd);
  AddrMode = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode  = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode = _CalcTransferMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Calculate the number of bytes in each command phase.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = (NumBytesAlt - 1) & CCR_ABSIZE_MASK;
  }
  //
  // Configure the operation.
  //
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (DataDTR  << CCR_DDTR_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AddrDTR  << CCR_ABDTR_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrDTR  << CCR_ADDTR_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (InstMode << CCR_IMODE_BIT)
         | (InstDTR  << CCR_IDTR_BIT)
         | (InstSize << CCR_ISIZE_BIT)
         | (DataDTR  << CCR_DQSE_BIT)
         ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK  << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_READ  << CR_FMODE_BIT;
  TCfgReg    =   OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  TCfgReg   |=   NumCyclesDummy << TCR_DCYC_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                              // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  //
  // Execute the command.
  //
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                            // Error, could not clear status flags.
  }
#if FS_NOR_HW_USE_OS
  _StatusOSPI = 0;
#endif // FS_NOR_HW_USE_OS
  NumBytesToRead = NumBytesData - 1;        // We have to subtract 1 because 0 means "read 1 byte".
  if (NumBytesData != 0u) {
    OCTOSPI_DLR = NumBytesToRead;
  }
  OCTOSPI_DCR1 = DevCfgReg;
  OCTOSPI_CR   = CtrlReg;
  OCTOSPI_ABR  = AltReg;
  OCTOSPI_CCR  = CfgReg;
  OCTOSPI_TCR  = TCfgReg;
  OCTOSPI_IR   = InstReg;
  if (NumBytesAddr != 0u) {
    OCTOSPI_AR = AddrReg;
  }
  //
  // Receive the data from NOR flash device.
  //
  r = 0;
  if (NumBytesData != 0u) {
#if FS_NOR_HW_USE_DMA
    if (_IsDataAligned(pData, NumBytesData) != 0) {
      _StartDMATransfer((U32 *)pData, NumBytesData, 0);
      Result = _WaitForEndOfDMATransfer();
    } else
#endif // FS_NOR_HW_USE_DMA
    {
      Result = _ReadDataViaCPU(pData, NumBytesData);
    }
    if (Result != 0) {
      r = 1;
    }
  }
  //
  // Wait until the data transfer has been completed.
  //
  Result = _WaitForTransferComplete();
  if (Result != 0) {
    r = 1;
  }
Done:
  return r;
}

/*********************************************************************
*
*       _Write
*
*  Function description
*    Transfers data from MCU to NOR flash.
*/
static int _Write(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, const U8 * pData, unsigned NumBytesData, U16 BusWidth, unsigned Flags) {
  U32 AddrReg;
  U32 AltReg;
  U32 CfgReg;
  U32 CtrlReg;
  U32 DataMode;
  U32 AddrMode;
  U32 AltMode;
  U32 InstMode;
  U32 AddrSize;
  U32 AltSize;
  U32 NumBytes;
  U32 NumBytesAlt;
  U32 InstReg;
  U32 InstDTR;
  U32 AddrDTR;
  U32 DataDTR;
  int r;
  int Result;
  U32 InstSize;
  U32 TCfgReg;
  U32 MemType;
  U32 DevCfgReg;
  U32 TimeOut;

  FS_USE_PARA(Unit);
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  AddrDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_ADDR) != 0u) {
    AddrDTR = 1;
  }
  DataDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_DATA) != 0u) {
    DataDTR = 1;
  }
  //
  // Fill local variables.
  //
  InstReg     = 0;
  AddrReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the dummy and mode bytes.
  //
  if (NumBytesPara > NumBytesAddr) {
    NumBytes = NumBytesAlt;
    do {
      AltReg <<= 8;
      AltReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Calculate the number of data lines to be used for the transfer.
  //
  InstMode = _CalcTransferMode(FS_BUSWIDTH_GET_CMD(BusWidth), NumBytesCmd);
  AddrMode = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode  = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode = _CalcTransferMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Calculate the number of bytes in each command phase.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = NumBytesAddr - 1;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = NumBytesAlt - 1;
  }
  //
  // Configure the operation.
  //
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (DataDTR  << CCR_DDTR_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AddrDTR  << CCR_ABDTR_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrDTR  << CCR_ADDTR_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (InstMode << CCR_IMODE_BIT)
         | (InstDTR  << CCR_IDTR_BIT)
         | (InstSize << CCR_ISIZE_BIT)
         ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK  << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_WRITE << CR_FMODE_BIT;
  TCfgReg    =   OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                              // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  //
  // Execute the command.
  //
#if FS_NOR_HW_USE_OS
  _StatusOSPI = 0;
#endif // FS_NOR_HW_USE_OS
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                            // Error, could not clear status flags.
  }
  if (NumBytesData != 0u) {
    OCTOSPI_DLR = NumBytesData - 1;       // 0 means "write 1 byte".
  }
  OCTOSPI_DCR1 = DevCfgReg;
  OCTOSPI_CR   = CtrlReg;
  OCTOSPI_ABR  = AltReg;
  OCTOSPI_CCR  = CfgReg;
  OCTOSPI_TCR  = TCfgReg;
  OCTOSPI_IR   = InstReg;
  if (NumBytesAddr != 0u) {
    OCTOSPI_AR = AddrReg;
  }
  //
  // Send data to the NOR flash device.
  //
  r = 0;
  if (NumBytesData != 0u) {
#if FS_NOR_HW_USE_DMA
    if (_IsDataAligned(pData, NumBytesData) != 0) {
      _StartDMATransfer((U32 *)pData, NumBytesData, 1);
      Result = _WaitForEndOfDMATransfer();
    } else
#endif // FS_NOR_HW_USE_DMA
    {
      Result = _WriteDataViaCPU(pData, NumBytesData);
    }
    if (Result != 0) {
      r = 1;
    }
  }
  //
  // Wait until the data transfer has been completed.
  //
  Result = _WaitForTransferComplete();
  if (Result != 0) {
    r = 1;
  }
Done:
  return r;
}

#if FS_NOR_HW_USE_OS

/*********************************************************************
*
*       _Poll
*
*  Function description
*    Checks periodically the value of a status flag.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    pCmd           [IN] Code of the command to be sent. Cannot be NULL.
*    NumBytesCmd    Number of bytes in the command code. Cannot be 0.
*    pPara          [IN] Command parameters (address and dummy bytes). Can be NULL.
*    NumBytesPara   Total number of address and dummy bytes to be sent. Can be 0.
*    NumBytesAddr   Number of address bytes to be send. Can be 0.
*    BitPos         Position of the bit to be checked.
*    BitValue       Value of the bit to wait for.
*    Delay          Number of clock cycles to wait between two queries.
*    TimeOut_ms     Maximum number of milliseconds to wait for the bit to be set.
*    BusWidth       Number of data lines to be used for the data transfer.
*    Flags          Options for the data exchange.
*
*  Return value
*    > 0    Timeout occurred.
*    ==0    OK, bit set to specified value.
*    < 0    Feature not supported.
*/
static int _Poll(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U8 BitPos, U8 BitValue, U32 Delay, U32 TimeOut_ms, U16 BusWidth, unsigned Flags) {
  int r;
  U32 CfgReg;
  U32 CtrlReg;
  U32 DataMode;
  U32 InstMode;
  U32 NumBytes;
  U32 NumBytesData;
  U32 DataMask;
  U32 DataMatch;
  U32 Status;
  U32 InstReg;
  U32 AddrReg;
  U32 AltReg;
  U32 NumBytesAlt;
  U32 AddrMode;
  U32 AltMode;
  U32 AddrSize;
  U32 AltSize;
  U32 InstSize;
  U32 InstDTR;
  U32 AddrDTR;
  U32 DataDTR;
  U32 TCfgReg;
  U32 NumCyclesDummy;
  U32 MemType;
  U32 DevCfgReg;
  U32 TimeOut;

  FS_USE_PARA(Unit);
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  AddrDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_ADDR) != 0u) {
    AddrDTR = 1;
  }
  DataDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_DATA) != 0u) {
    DataDTR = 1;
  }
  //
  // Fill local variables.
  //
  InstReg        = 0;
  AddrReg        = 0;
  AltReg         = 0;
  DataMask       = 1uL           << BitPos;
  DataMatch      = (U32)BitValue << BitPos;
  Delay        <<= 4;                                                               // 16 clock cycles are required to transfer 2 bytes.
  NumBytesData   = 1;                                                               // The response consists of only one byte.
  NumBytesAlt    = NumBytesPara - NumBytesAddr;
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the mode and dummy bytes.
  //
  NumCyclesDummy = 0;
  if (NumBytesAlt != 0) {
    NumBytes = NumBytesAlt;
    //
    // Check if a mode byte has to be sent and if yes encode its value.
    //
    if (   ((Flags & FS_NOR_HW_FLAG_MODE_8BIT) != 0u)
        || ((Flags & FS_NOR_HW_FLAG_MODE_4BIT) != 0u)) {                            // OCTOSPI is not able to send a number of mode bits that is not a multiple of eight.
      NumBytes    = NumBytesAlt - 1u;
      NumBytesAlt = 1;                                                              // We never send more than one mode byte.
      if (pPara != NULL) {
        AltReg = (U32)*pPara;
      } else {
        AltReg = 0xFFuL;
      }
    } else {
      NumBytesAlt = 0;
    }
    if (NumBytes != 0u) {
      //
      // The remaining alternate bytes are not sent. Instead, we generate dummy cycles.
      //
      NumCyclesDummy = _CalcNumCycles(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytes, AddrDTR);
    }
  }
  //
  // Calculate the number of data lines to be used for the transfer.
  //
  InstMode = _CalcTransferMode(FS_BUSWIDTH_GET_CMD(BusWidth), NumBytesCmd);
  AddrMode = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode  = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode = _CalcTransferMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Calculate the number of bytes in each command phase.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = (NumBytesAlt - 1) & CCR_ABSIZE_MASK;
  }
  //
  // Configure the operation.
  //
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (DataDTR  << CCR_DDTR_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AddrDTR  << CCR_ABDTR_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrDTR  << CCR_ADDTR_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (InstMode << CCR_IMODE_BIT)
         | (InstDTR  << CCR_IDTR_BIT)
         | (InstSize << CCR_ISIZE_BIT)
         ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_POLL << CR_FMODE_BIT;
  TCfgReg    = OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  TCfgReg   |=   NumCyclesDummy << TCR_DCYC_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                              // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  //
  // Start the poll operation. The end of operation is signaled via interrupt.
  //
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                            // Error, could not clear status flags.
  }
  _StatusOSPI = 0;
  if (NumBytesData) {
    OCTOSPI_DLR = NumBytesData - 1;       // 0 means "read 1 byte".
  }
  OCTOSPI_DCR1  = DevCfgReg;
  OCTOSPI_ABR   = AltReg;
  OCTOSPI_CR    = CtrlReg;
  OCTOSPI_PSMKR = DataMask;
  OCTOSPI_PSMAR = DataMatch;
  OCTOSPI_PIR   = Delay;
  OCTOSPI_FCR   = 1uL << SR_SMF_BIT;
  OCTOSPI_CCR   = CfgReg;
  OCTOSPI_TCR   = TCfgReg;
  OCTOSPI_IR    = InstReg;
  if (NumBytesAddr != 0u) {
    OCTOSPI_AR = AddrReg;
  }
  for (;;) {
    Status = _StatusOSPI;
    if (Status & (1uL << SR_SMF_BIT)) {
      r = 0;                                // Bit set to the requested value.
      break;
    }
    r = FS_X_OS_Wait(TimeOut_ms);
    if (r != 0) {
      //
      // The timeout has expired. Cancel the polling operation.
      //
      (void)_Cancel();
      r = 1;                                // A timeout occurred.
      break;
    }
  }
Done:
  return r;
}

#endif // FS_NOR_HW_USE_OS

/*********************************************************************
*
*      Public code (via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_Init
*
*  Function description
*    Initializes the SPI hardware.
*
*  Parameters
*    Unit       Index of the hardware layer (0-based).
*
*  Return value
*    > 0      OK, frequency of the SPI clock in Hz.
*    ==0      An error occurred.
*/
static int _HW_Init(U8 Unit) {
  U32 Freq_Hz;

