jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32U575/FS_NOR_HW_SPIFI_STM32U575_ST_STM32U575I_EV.c
  FS_USE_PARA(Unit);
  //
  // Select the clock source for OCTOSPI.
  //
  RCC_CCIPR2 &= ~(CCIPR2_OCTOSPISEL_MASK << CCIPR2_OCTOSPISEL_BIT);
  //
  // Enable the clocks of peripherals and reset them.
  //
  RCC_AHB2ENR1 |= 0
               | (1uL << AHB2ENR1_GPIOFEN)
               | (1uL << AHB2ENR1_GPIOHEN)
               | (1uL << AHB2ENR1_GPIOIEN)
               | (1uL << AHB2ENR1_OCTOSPIMEN)
               ;
  RCC_AHB1ENR  |= 0
               | (1uL << AHB1ENR_DCACHE1EN)         // Acc. to [1] it is necessary to enable this clock even when the data cache is not used.
#if FS_NOR_HW_USE_DMA
               | (1uL << AHB1ENR_GPDMA1EN)
#endif // FS_NOR_HW_USE_DMA
               ;
  RCC_AHB2ENR2 |= 1uL << AHB2ENR2_OCTOSPI2EN;
  //
  // Wait for the unit to exit reset.
  //
  for (;;) {
    if ((RCC_AHB2RSTR2 & (1uL << AHB2ENR2_OCTOSPI2EN)) == 0) {
      break;
    }
  }
  //
  // CS is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_CS_BIT       << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_CS_BIT       << 1));
  GPIOI_AFRL    &= ~(AFR_MASK     << ((NOR_CS_BIT - 0)  << 2));
  GPIOI_AFRL    |=  (0x5uL        << ((NOR_CS_BIT - 0)  << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CS_BIT       << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CS_BIT       << 1));
  //
  // DQS is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_DQS_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_DQS_BIT      << 1));
  GPIOH_AFRL    &= ~(AFR_MASK     << ((NOR_DQS_BIT - 0) << 2));
  GPIOH_AFRL    |=  (0x5uL        << ((NOR_DQS_BIT - 0) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_DQS_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_DQS_BIT      << 1));
  //
  // CLK is an output signal controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_CLK_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_CLK_BIT      << 1));
  GPIOH_AFRL    &= ~(AFR_MASK     << ((NOR_CLK_BIT - 0) << 2));
  GPIOH_AFRL    |=  (0x5uL        << ((NOR_CLK_BIT - 0) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CLK_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CLK_BIT      << 1));
  //
  // D0 is an input/output signal controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_D0_BIT      << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_D0_BIT      << 1));
  GPIOI_AFRL    &= ~(AFR_MASK     << ((NOR_D0_BIT - 0) << 2));
  GPIOI_AFRL    |=  (0x6uL        << ((NOR_D0_BIT - 0) << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D0_BIT      << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D0_BIT      << 1));
  //
  // D1 is an input/output signal controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_D1_BIT      << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_D1_BIT      << 1));
  GPIOI_AFRL    &= ~(AFR_MASK     << ((NOR_D1_BIT - 0) << 2));
  GPIOI_AFRL    |=  (0x6uL        << ((NOR_D1_BIT - 0) << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D1_BIT      << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D1_BIT      << 1));
  //
  // D2 is an input/output signal and is controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_D2_BIT      << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_D2_BIT      << 1));
  GPIOI_AFRL    &= ~(AFR_MASK     << ((NOR_D2_BIT - 0) << 2));
  GPIOI_AFRL    |=  (0x6uL        << ((NOR_D2_BIT - 0) << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D2_BIT      << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D2_BIT      << 1));
  //
  // D3 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D3_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D3_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D3_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D3_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D3_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D3_BIT      << 1));
  //
  // D4 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D4_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D4_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D4_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D4_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D4_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D4_BIT      << 1));
  //
  // D5 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D5_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D5_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D5_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D5_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D5_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D5_BIT      << 1));
  //
  // D6 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D6_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D6_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D6_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D6_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D6_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D6_BIT      << 1));
  //
  // D7 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D7_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D7_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D7_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D7_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D7_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D7_BIT      << 1));
#if FS_NOR_HW_USE_DMA
  //
  // Initialize DMA.
  //
  GPDMA_CLBAR = 0;
  GPDMA_CTR3  = 0;
  GPDMA_CBR2  = 0;
  GPDMA_CLLR  = 0;
#endif // FS_NOR_HW_USE_DMA
#if FS_NOR_HW_USE_OS
  //
  // Disable the interrupt and configure the priority.
  //
  NVIC_DisableIRQ(OCTOSPI2_IRQn);
  NVIC_SetPriority(OCTOSPI2_IRQn, OCTOSPI_PRIO);
#if FS_NOR_HW_USE_DMA
  NVIC_DisableIRQ(GPDMA1_Channel0_IRQn);
  NVIC_SetPriority(GPDMA1_Channel0_IRQn, GPDMA1_PRIO);
#endif // FS_NOR_HW_USE_DMA
#endif // FS_NOR_HW_USE_OS
  //
  // Initialize the Octo-SPI controller.
  //
  Freq_Hz = FS_NOR_HW_NOR_CLK_HZ;
  _ClkDiv = _CalcClockDivider(&Freq_Hz);
  _Reset();
#if FS_NOR_HW_USE_OS
  NVIC_EnableIRQ(OCTOSPI2_IRQn);
#if FS_NOR_HW_USE_DMA
  NVIC_EnableIRQ(GPDMA1_Channel0_IRQn);
#endif // FS_NOR_HW_USE_DMA
#endif // FS_NOR_HW_USE_OS
  return (int)Freq_Hz;
}

/*********************************************************************
*
*       _HW_Unmap
*
*  Function description
*    Configures the hardware for direct access to serial NOR flash.
*
*  Parameters
*    Unit       Index of the hardware layer (0-based).
*/
static void _HW_Unmap(U8 Unit) {
  FS_USE_PARA(Unit);

  //
  // Cancel the memory mode so that the BUSY bit goes to 0
  // and we can write to OCTOSPI_CCR register.
  //
  if ((OCTOSPI_CR & (CR_FMODE_MASK << CR_FMODE_BIT)) == (CR_FMODE_MMAP << CR_FMODE_BIT)) {
    _Cancel();
  }
  _Reset();
}

#if FS_NOR_HW_USE_MEM_MODE

/*********************************************************************
*
*       _HW_Map
*
*  Function description
*    Configures the hardware for access to serial NOR flash via system memory.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    ReadCmd        Code of the command to be used for reading the data.
*    NumBytesAddr   Number of address bytes to be used for the read command.
*    NumBytesDummy  Number of dummy bytes to be sent after the read command.
*    BusWidth       Number of data lines to be used for the data transfer.
*/
static void _HW_Map(U8 Unit, U8 ReadCmd, unsigned NumBytesAddr, unsigned NumBytesDummy, U16 BusWidth) {
  unsigned NumBytesPara;

  NumBytesPara = NumBytesAddr + NumBytesDummy;
  (void)_Map(Unit, &ReadCmd, sizeof(ReadCmd), NULL, NumBytesPara, NumBytesAddr, BusWidth, 0);
}

#endif // FS_NOR_HW_USE_MEM_MODE

/*********************************************************************
*
*       _HW_Control
*
*  Function description
*    Sends a command to serial NOR flash that does not transfer any data.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    Cmd            Code of the command to be sent.
*    BusWidth       Number of data lines to be used for sending the command.
*/
static void _HW_Control(U8 Unit, U8 Cmd, U8 BusWidth) {
  (void)_Control(Unit, &Cmd, sizeof(Cmd), BusWidth, 0);
}

/*********************************************************************
*
*       _HW_Read
*
*  Function description
*    Transfers data from serial NOR flash to MCU.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    Cmd            Code of the command to be sent.
*    pPara          [IN] Command parameters (address and dummy bytes). Can be NULL.
*    NumBytesPara   Total number of address and dummy bytes to be sent. Can be 0.
*    NumBytesAddr   Number of address bytes to be send. Can be 0.
*    pData          [OUT] Data read from the serial NOR flash device. Can be NULL.
*    NumBytesData   Number of bytes to read from the serial NOR flash device. Can be 0.
*    BusWidth       Number of data lines to be used for the data transfer.
*/
static void _HW_Read(U8 Unit, U8 Cmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U8 * pData, unsigned NumBytesData, U16 BusWidth) {
  (void)_Read(Unit, &Cmd, sizeof(Cmd), pPara, NumBytesPara, NumBytesAddr, pData, NumBytesData, BusWidth, 0);
}

/*********************************************************************
*
*       _HW_Write
*
*  Function description
*    Transfers data from MCU to serial NOR flash.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    Cmd            Code of the command to be sent.
*    pPara          [IN] Command parameters (address and dummy bytes). Can be NULL.
*    NumBytesPara   Total number of address and dummy bytes to be sent. Can be 0.
*    NumBytesAddr   Number of address bytes to be send. Can be 0.
*    pData          [IN] Data to be sent to the serial NOR flash device. Can be NULL.
*    NumBytesData   Number of bytes to be written the serial NOR flash device. Can be 0.
*    BusWidth       Number of data lines to be used for the data transfer.
*/
static void _HW_Write(U8 Unit, U8 Cmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, const U8 * pData, unsigned NumBytesData, U16 BusWidth) {
  (void)_Write(Unit, &Cmd, sizeof(Cmd), pPara, NumBytesPara, NumBytesAddr, pData, NumBytesData, BusWidth, 0);
}

/*********************************************************************
*
*       _HW_Poll
*
*  Function description
*    Checks periodically the value of a status flag.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    Cmd            Code of the command to be sent.
*    BitPos         Position of the bit to be checked.
*    BitValue       Value of the bit to wait for.
*    Delay          Number of clock cycles to wait between two queries.
*    TimeOut_ms     Maximum number of milliseconds to wait for the bit to be set.
*    BusWidth       Number of data lines to be used for the data transfer.
*
*  Return value
*    > 0    Timeout occurred.
*    ==0    OK, bit set to specified value.
*    < 0    Feature not supported.
*/
static int _HW_Poll(U8 Unit, U8 Cmd, U8 BitPos, U8 BitValue, U32 Delay, U32 TimeOut_ms, U16 BusWidth) {
  int r;

#if FS_NOR_HW_USE_OS
  r = _Poll(Unit, &Cmd, sizeof(Cmd), NULL, 0, 0, BitPos, BitValue, Delay, TimeOut_ms, BusWidth, 0);
#else
  FS_USE_PARA(Unit);
  FS_USE_PARA(Cmd);
  FS_USE_PARA(BitPos);
  FS_USE_PARA(BitValue);
  FS_USE_PARA(Delay);
  FS_USE_PARA(TimeOut_ms);
  FS_USE_PARA(BusWidth);
  r = -1;                 // Set to indicate that the feature is not supported.
#endif
  return r;
}

/*********************************************************************
*
*       _HW_Delay
*
*  Function description
*    Blocks the execution for the specified time.
*
*  Parameters
*    Unit       Index of the hardware layer (0-based).
*    ms         Number of milliseconds to block the execution.
*
*  Return value
*    ==0    OK, delay executed.
*    < 0    Functionality not supported.
*/
static int _HW_Delay(U8 Unit, U32 ms) {
  int r;

  FS_USE_PARA(Unit);
  r = -1;                 // Set to indicate that the feature is not supported.
#if FS_NOR_HW_USE_OS
  if (ms) {
    FS_X_OS_Delay(ms);
    r = 0;
  }
#else
  FS_USE_PARA(ms);
#endif
  return r;
}

#if FS_NOR_HW_USE_MEM_MODE

/*********************************************************************
*
*       _HW_MapEx
*
*  Function description
*    Configures the hardware for access to serial NOR flash via system memory.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    pCmd           [IN] Code of the command to be used for reading the data. Cannot be NULL.
*    NumBytesCmd    Number of bytes in the command code. Cannot be 0.
*    pPara          [IN] Command parameters (address and dummy bytes). Can be NULL.
*    NumBytesPara   Total number of address and dummy bytes to be sent. Can be 0.
*    NumBytesAddr   Number of address bytes to be send. Can be 0.
*    BusWidth       Number of data lines to be used for the data transfer.
*    Flags          Options for the data exchange.
*
*  Return value
*    ==0      OK, memory mode configured successfully.
*    !=0      An error occurred.
*/
static int _HW_MapEx(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U16 BusWidth, unsigned Flags) {
  int r;

  r = _Map(Unit, pCmd, NumBytesCmd, pPara, NumBytesPara, NumBytesAddr, BusWidth, Flags);
  return r;
}

#endif // FS_NOR_HW_USE_MEM_MODE

/*********************************************************************
*
*       _HW_ControlEx
*
*  Function description
*    Sends a command to serial NOR flash that does not transfer any data.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    pCmd           [IN] Code of the command to be sent. Cannot be NULL.
*    NumBytesCmd    Number of bytes in the command code. Cannot be 0.
*    BusWidth       Number of data lines to be used for sending the command.
*    Flags          Options for the data exchange.
*
*  Return value
*    ==0      OK, command transferred successfully.
*    !=0      An error occurred.
*/
static int _HW_ControlEx(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, U8 BusWidth, unsigned Flags) {
  int r;

